<?php
class Home extends CI_CONTROLLER{
    public function __construct(){
        parent::__construct();
    }

    public function index(){
        if(!empty($_GET['page'])){
            $page = $_GET['page'];
            if($page == MD5("hal 1")){
                $data['title'] = 'Halaman 1';
                $data['kata'] = [
                    [
                        "kata" => "اِذَا تَـلٰـهَا",
                        "audio" => "1.1.m4a"
                    ],
                    [
                        "kata" => "اِذَا جَـلّٰـهَا",
                        "audio" => "1.2.m4a"
                    ],
                    [
                        "kata" => "اِذَا يَـغۡـشٰـهَا",
                        "audio" => "1.3.m4a"
                    ],
                    [
                        "kata" => "ذٰلِكَ دَحٰـهَا",
                        "audio" => "1.4.m4a"
                    ],
                    [
                        "kata" => "وَمَا بَـنٰـهَا",
                        "audio" => "1.5.m4a"
                    ],
                    [
                        "kata" => "وَمَا طَحٰـهَا",
                        "audio" => "1.6.m4a"
                    ],
                    [
                        "kata" => "وَمَا سَوّٰىـهَا",
                        "audio" => "1.7.m4a"
                    ],
                    [
                        "kata" => "بِـمَا تَـسۡعٰى",
                        "audio" => "1.8.m4a"
                    ],
                    [
                        "kata" => "وَلَا يَحۡيٰ",
                        "audio" => "1.9.m4a"
                    ],
                    [
                        "kata" => "وَلَا يَـشۡقٰى",
                        "audio" => "1.10.m4a"
                    ]
                ];

                $data['next'] = base_url()."?page=".MD5('hal 2');
            } else if($page == MD5("hal 2")){
                $data['title'] = 'Halaman 2';
                $data['kata'] = [
                    [
                        "kata" => "مَوَالِـيۡـكُـمۡ",
                        "audio" => "2.1.m4a"
                    ],
                    [
                        "kata" => "سَاٰتِـيۡـكُـمۡ",
                        "audio" => "2.2.m4a"
                    ],
                    [
                        "kata" => "فِيۡ جِـيۡـدِهَا",
                        "audio" => "2.3.m4a"
                    ],
                    [
                        "kata" => "خٰـلِـدِيۡـنَ فِـيۡـهَا",
                        "audio" => "2.4.m4a"
                    ],
                    [
                        "kata" => "اٰيٰـتِيۡ وَرُسُـلِيۡ",
                        "audio" => "2.5.m4a"
                    ],
                    [
                        "kata" => "عَلٰى شَاكِلَـتِـهٖ",
                        "audio" => "2.6.m4a"
                    ],
                    [
                        "kata" => "اَلَّـذِيۡ يُـمِيۡـتُـنِيۡ",
                        "audio" => "2.7.m4a"
                    ], 
                    [
                        "kata" => "يَـهۡـدِيۡ لِلَّتِيۡ",
                        "audio" => "2.8.m4a"
                    ],
                    [
                        "kata" => "وَنَاٰبِجَانِـبِـهٖ",
                        "audio" => "2.9.m4a"
                    ],
                    [
                        "kata" => "كَانَ بِعِـبَادِهٖ",
                        "audio" => "2.10.m4a"
                    ],
                ];
                
                $data['back'] = base_url()."?page=".MD5('hal 1');
                $data['next'] = base_url()."?page=".MD5('hal 3');
            } else if($page == MD5("hal 3")){
                $data['title'] = 'Halaman 3';
                $data['kata'] = [
                    [
                        "kata" => "يَـسُوۡمُـوۡنَـكُـمۡ",
                        "audio" => "3.1.m4a"
                    ],
                    [
                        "kata" => "اٰيٰـتُـهٗ زَادَتۡـهُمۡ",
                        "audio" => "3.2.m4a"
                    ],
                    [
                        "kata" => "رَبَّهٗ فَـغَـوٰى",
                        "audio" => "3.3.m4a"
                    ],
                    [
                        "kata" => "وَمَا ظَلَـمُـوۡنَا",
                        "audio" => "3.4.m4a"
                    ],
                    [
                        "kata" => "وَمَا تَـفۡعَلُوۡا",
                        "audio" => "3.5.m4a"
                    ],
                    [
                        "kata" => "فَيُضٰعِفَهٗ لَهٗ",
                        "audio" => "3.6.m4a"
                    ],
                    [
                        "kata" => "لَهٗ لَـنٰصِحُـوۡنَ",
                        "audio" => "3.7.m4a"
                    ],
                    [
                        "kata" => "لَهٗ لَحٰـفِظُـوۡنَ",
                        "audio" => "3.8.m4a"
                    ],
                    [
                        "kata" => "يَفۡقَهُوۡا قَـوۡلِيۡ",
                        "audio" => "3.9.m4a"
                    ],
                    [
                        "kata" => "هٰـرُوۡنَ اَخِيۡ",
                        "audio" => "3.10.m4a"
                    ],
                ];
                $data['back'] = base_url()."?page=".MD5('hal 2');
                $data['next'] = base_url()."?page=".MD5('hal 4');
            } else if($page == MD5("hal 4")){
                $data['title'] = 'Halaman 4';
                $data['kata'] = [
                    [
                        "kata" => "يَـسُوۡمُـوۡنَـكُـمۡ",
                        "audio" => "4.1.m4a"
                    ],
                    [
                        "kata" => "وَالَّـيْـلِ اِذَا يَـغْـشٰـهَا",
                        "audio" => "4.2.m4a"
                    ],
                    [
                        "kata" => "وَالنَّـهَارِ اِذَا جَـلّٰـهَا",
                        "audio" => "4.3.m4a"
                    ],
                    [
                        "kata" => "وَالْاَرْضِ وَمَـاطَـحٰـهَا",
                        "audio" => "4.4.m4a"
                    ],
                    [
                        "kata" => "فَـكَـذَّبُـوْهُ فَـعَـقَـرُوْهَـا",
                        "audio" => "4.5.m4a"
                    ],
                    [
                        "kata" => "فِـيْـهَا مَاٰرِبُ اُخْـرٰى",
                        "audio" => "4.6.m4a"
                    ],
                    [
                        "kata" => "قَـالَ اَلْـقِـهَا يٰـمُـوسٰى",
                        "audio" => "4.7.m4a"
                    ],
                    [
                        "kata" => "هَاجَـرُوْا وَجٰـهَـدُوْا",
                        "audio" => "4.8.m4a"
                    ],
                    [
                        "kata" => "وَتَـتَّـقُـوْا وَتُـصْـلِـحُـوْا",
                        "audio" => "4.9.m4a"
                    ],
                    [
                        "kata" => "بِـرِسٰـلٰـتِيْ وَ بِـكَـلٰـمِيْ",
                        "audio" => "4.10.m4a"
                    ],
                    [
                        "kata" => "وَلَاتَـنِـيَا فِيْ ذِكْـرِيْ",
                        "audio" => "4.11.m4a"
                    ],
                    [
                        "kata" => "كَـفَـرُوْا بِـمَا عَـمِـلُـوْا",
                        "audio" => "4.12.m4a"
                    ],
                    [
                        "kata" => "وَ وَجَـدُوْا مَا عَـمِـلُـوْا",
                        "audio" => "4.13.m4a"
                    ],
                    [
                        "kata" => "وَ عَـدَسِـهَا وَ بَـصَـلِـهَا",
                        "audio" => "4.14.m4a"
                    ],
                    [
                        "kata" => "رَبِّ نَـجِّـنِيْ وَ اَهْـلِيْ",
                        "audio" => "4.15.m4a"
                    ],
                    [
                        "kata" => "فَاَصْـبَـحُـوْا فِيْ دَارِهِـمْ",
                        "audio" => "4.16.m4a"
                    ],
                    [
                        "kata" => "ذَهَـبَ اللهُ بِـنُـوْرِهِـمْ",
                        "audio" => "4.17.m4a"
                    ]
                ];
                $data['back'] = base_url()."?page=".MD5('hal 3');
                $data['next'] = base_url()."?page=".MD5('hal 5');
            } else if($page == MD5("hal 5")){
                $data['title'] = 'Halaman 5';
                $data['kata'] = [
                    [
                        "kata" => "اَلَّـذِيْ يُـؤْتِيْ مَالَـهٗ يَـتَـزَكّٰى",
                        "audio" => "5.1.m4a"
                    ],
                    [
                        "kata" => "مَا زَاغَ الْـبَصَـرُ وَ مَا طَـغٰى",
                        "audio" => "5.2.m4a"
                    ],
                    [
                        "kata" => "اَفَـتُـمٰـرُوْنَـهٗ عَلٰى مَا يَـرٰى",
                        "audio" => "5.3.m4a"
                    ],
                    [
                        "kata" => "يٰـلَـيْـتَـنِيْ قَـدَّمْـتُ لِـحَـيَـاتِيْ",
                        "audio" => "5.4.m4a"
                    ],
                    [
                        "kata" => "مَا وَدَّعَـكَ رَبُّـكَ وَمَا قَـلٰى",
                        "audio" => "5.5.m4a"
                    ],
                    [
                        "kata" => "هَـلْ اَتٰـكَ حَـدِيْـثُ مُـوْسٰى",
                        "audio" => "5.6.m4a"
                    ],
                    [
                        "kata" => "لَا يَـمُـوْتُ فِـيْـهَا وَلَا يَحْـيٰ",
                        "audio" => "5.7.m4a"
                    ]
                ];
                $data['back'] = base_url()."?page=".MD5('hal 4');
                $data['next'] = base_url()."?page=".MD5('hal 6');
            } else if($page == MD5("hal 6")){
                $data['title'] = 'Halaman 6';
                $data['kata'] = [
                    [
                        "kata" => "قَالَ فَـمَا بَالُ الْـقُـرُوْنِ الْاُوْلٰى",
                        "audio" => "6.1.m4a"
                    ],
                    [
                        "kata" => "لِـجَالُـوْتَ وَ جُـنُـوْدِهٖ قَالُـوْا رَبَّـنَا",
                        "audio" => "6.2.m4a"
                    ],
                    [
                        "kata" => "فَـئَاخَـرَانِ يَـقُـوْمَانِ مَـقَامَـهُـمَا",
                        "audio" => "6.3.m4a"
                    ],
                    [
                        "kata" => "تِـلْكَ حُـدُوْدُ اللهِ فَـلَا تَـعْـتَـدُوْهَا",
                        "audio" => "6.4.m4a"
                    ],
                    [
                        "kata" => "مَا ضَـلَّ صَاحِـبُـكُـمْ وَمَا غَـوٰى",
                        "audio" => "6.5.m4a"
                    ],
                    [
                        "kata" => "وَفُـوْمِـهَا وَ عَـدَسِـهَا وَ بَـصَـلِـهَا",
                        "audio" => "6.6.m4a"
                    ],
                    [
                        "kata" => "وَ اَغْـطَـشَ لَـيْـلَـهَا وَ اَخْـرَجَ ضُـحٰـهَا",
                        "audio" => "6.7.m4a"
                    ],
                    [
                        "kata" => "وفَـيَـحْـلِـفُـوْنَ لَـهٗ كَـمَا يَحْـلِـفُـوْنَ لَـكُـمْ",
                        "audio" => "6.8.m4a"
                    ]
                ];
                $data['back'] = base_url()."?page=".MD5('hal 5');
                $data['next'] = base_url()."?page=".MD5('hal 7');
            } else if($page == MD5("hal 7")){
                $data['title'] = 'Halaman 7';
                $data['kata'] = [
                    [
                        "kata" => "اَلْـهٰـكُـمُ الـتَّـكَاثُـرُ",
                        "audio" => "7.1.m4a"
                    ],
                    [
                        "kata" => "اَلَّـذِيْ عَـلَّـمَ بِالْـقَـلَـمِ",
                        "audio" => "7.2.m4a"
                    ],
                    [
                        "kata" => "وَ اللهُ بِـمَا تَـعْـمَـلُـوْنَ بَـصِـيْـرٌ",
                        "audio" => "7.3.m4a"
                    ],
                    [
                        "kata" => "مَا لَـكُـمْ كَـيْـفَ تَـحْـكُـمُـوْنَ",
                        "audio" => "7.4.m4a"
                    ]
                ];
                $data['back'] = base_url()."?page=".MD5('hal 6');
                $data['next'] = base_url()."?page=".MD5('hal 8');
            } else if($page == MD5("hal 8")){
                $data['title'] = 'Halaman 8';
                $data['kata'] = [
                    [
                        "kata" => "وَجَاهِـدُوْا فِيْ سَـبِـيْـلِـهٖ",
                        "audio" => "8.1.m4a"
                    ],
                    [
                        "kata" => "مَا عَـرَفُـوْا كَـفَـرُوْا بِـهٖ",
                        "audio" => "8.2.m4a"
                    ],
                    [
                        "kata" => "اَلَّـذِيْ نَـزَّلَ عَلٰى رَسُـوْلِهٖ",
                        "audio" => "8.3.m4a"
                    ],
                    [
                        "kata" => "يُـخَـوِّفُ اللهُ بِـهٖ عِـبَادَهٗ",
                        "audio" => "8.4.m4a"
                    ],
                    [
                        "kata" => "وَلَـوْ اَلْـقٰى مَـعَاذِيْـرَهٗ",
                        "audio" => "8.5.m4a"
                    ]
                ];
                $data['back'] = base_url()."?page=".MD5('hal 7');
                $data['next'] = base_url()."?page=".MD5('hal 9');
            } else if($page == MD5("hal 9")){
                $data['title'] = 'Halaman 9';
                $data['kata'] = [
                    [
                        "kata" => "لَايَـذُوْقُـوْنَ فِـيْـهَا بَـرْدًا",
                        "audio" => "9.1.m4a"
                    ],
                    [
                        "kata" => "كَانَ مِـزَاجُـهَا كَافُـوْرًا",
                        "audio" => "9.2.m4a"
                    ],
                    [
                        "kata" => "وَ رَتِّـلِ الْـقُـرْاٰنَ تَـرْتِـيْـلًا",
                        "audio" => "9.3.m4a"
                    ],
                    [
                        "kata" => "كَانُـوْا لَا يَـرْجُـوْنَ حِـسَابًا",
                        "audio" => "9.4.m4a"
                    ],
                    [
                        "kata" => "وَكَانَ عٰـقِـبَـةُ اَمْـرِهَا خُـسْـرًا",
                        "audio" => "9.5.m4a"
                    ]
                ];
                $data['back'] = base_url()."?page=".MD5('hal 8');
                $data['next'] = base_url()."?page=".MD5('hal 10');
            } else if($page == MD5("hal 10")){
                $data['title'] = 'Halaman 10';
                $data['kata'] = [
                    [
                        "kata" => "لَا تَـسْـمَـعُ فِـيْـهَا لٰـغِـيَـةً",
                        "audio" => "10.1.m4a"
                    ],
                    [
                        "kata" => "يٰـلَـيْـتَـهَا كَانَـتِ الْـقَاضِـيَةَ",
                        "audio" => "10.2.m4a"
                    ],
                    [
                        "kata" => "كلَّا بَـلْ تُحِـبُّـوْنَ الْـعَاجِـلَـةَ",
                        "audio" => "10.3.m4a"
                    ],
                    [
                        "kata" => "هَـلْ اَتٰـكَ حَـدِيْـثُ الْـغٰـشِـيَـةِ",
                        "audio" => "10.4.m4a"
                    ]
                ];
                $data['back'] = base_url()."?page=".MD5('hal 9');
                $data['next'] = base_url()."?page=".MD5('hal 11');
            } else if($page == MD5("hal 11")){
                $data['title'] = 'Halaman 11';
                $data['kata'] = [
                    [
                        "kata" => "وَالَّـيْـلِ اِذَا يَـسْـرِ",
                        "audio" => "11.1.m4a"
                    ],
                    [
                        "kata" => "وَمَا هُـوَ بِالْـهَـزْلِ",
                        "audio" => "11.2.m4a"
                    ],
                    [
                        "kata" => "وَقَالُـوْا قُـلُـوْبُـنَا غُـلْـفٌ",
                        "audio" => "11.3.m4a"
                    ],
                    [
                        "kata" => "فَاَلْـقِـيْـهِ فِى الْـيَـمِّ",
                        "audio" => "11.4.m4a"
                    ],
                    [
                        "kata" => "سَـرٰبِـيْـلَ تَـقِـيْـكُـمُ الْـحَـرَّ",
                        "audio" => "11.5.m4a"
                    ]
                ];
                $data['back'] = base_url()."?page=".MD5('hal 10');
                $data['next'] = base_url()."?page=".MD5('hal 12');
            } else if($page == MD5("hal 12")){
                $data['title'] = 'Halaman 12';
                $data['kata'] = [
                    [
                        "kata" => "وَيُـعَـلِّـمُـهُـمُ الْـكِـتَابَ وَ الْـحِـكْـمَـةَ",
                        "audio" => "12.1.m4a"
                    ],
                    [
                        "kata" => "وَ يُـشْـهِـدُ اللهَ عَلٰى مَا فِيْ قَـلْـبِـهٖ",
                        "audio" => "12.2.m4a"
                    ],
                    [
                        "kata" => "مَا لَـكُـمْ لَا تَـرْجُـوْنَ لِلّٰهِ وَقَارًا",
                        "audio" => "12.3.m4a"
                    ],
                    [
                        "kata" => "لَا تُـحَـرِّكْ بِـهٖ لِـسَانَـكَ لِـتَـعْـجَـلَ بِهٖ",
                        "audio" => "12.4.m4a"
                    ],
                    [
                        "kata" => "فَـيُـعَـذِّبُـهُ اللهُ الْـعَـذَابَ الْاَكْـبَـرَ",
                        "audio" => "12.5.m4a"
                    ],
                    [
                        "kata" => "ذٰلِـكَ الْـيَـوْمُ الَّـذِيْ كَانُـوْا يُـوْعَـدُوْنَ",
                        "audio" => "12.6.m4a"
                    ],
                    [
                        "kata" => "يَـتَـخَـبَّـطُـهُ الشَّــيْـطٰنُ مِنَ الْمَسِّ",
                        "audio" => "12.7.m4a"
                    ],
                    [
                        "kata" => "وَتَـوَاصَـوْا بِالْـحَـقِّ وَ تَـوَاصَـوْا بِالصَّـبْـرِ",
                        "audio" => "12.8.m4a"
                    ]
                ];
                $data['back'] = base_url()."?page=".MD5('hal 11');
                $data['next'] = base_url()."?page=".MD5('hal 13');
            } else if($page == MD5("hal 13")){
                $data['title'] = 'Halaman 13';
                $data['kata'] = [
                    [
                        "kata" => "لٰـبِـثِـيْنَ فِـيْـهَآ اَحْـقَـابًا",
                        "audio" => "13.1.m4a"
                    ],
                    [
                        "kata" => "وَ السَّـمَآءِ وَمَا بَـنٰـهَا",
                        "audio" => "13.2.m4a"
                    ],
                    [
                        "kata" => "نِـسَآءَنَا وَ نِـسَاءَكُـمْ",
                        "audio" => "13.3.m4a"
                    ],
                    [
                        "kata" => "لَـهُ الْاَسْـمَآءُ الْـحُـسْنٰى",
                        "audio" => "13.4.m4a"
                    ],
                    [
                        "kata" => "وَالـصّٰٓـفّٰـتِ صَـفًّا",
                        "audio" => "13.5.m4a"
                    ]
                ];
                $data['back'] = base_url()."?page=".MD5('hal 12');
                $data['next'] = base_url()."?page=".MD5('hal 14');
            } else if($page == MD5("hal 14")){
                $data['title'] = 'Halaman 14';
                $data['kata'] = [
                    [
                        "kata" => "وَ هُـوَ اَعْـلَـمُ بِالْـمُـهْـتَـدِيْنَ",
                        "audio" => "14.1.m4a"
                    ],
                    [
                        "kata" => "مَـرَجَ الْـبَـحْـرَيْنِ يَـلْـتَـقِـيٰنِ",
                        "audio" => "14.2.m4a"
                    ],
                    [
                        "kata" => "وَ الْاَرْضَ وَ ضَـعَـهَا لِلْاَنَامِ",
                        "audio" => "14.3.m4a"
                    ],
                    [
                        "kata" => "تَـبَارَكَ اللهُ رَبُّ الْـعٰـلَـمِـيْنَ",
                        "audio" => "14.4.m4a"
                    ],
                    [
                        "kata" => "فِـيْـمَا كَانُـوْا فِـيْـهِ يَـخْـتَـلِـفُـوْنَ",
                        "audio" => "14.5.m4a"
                    ],
                ];
                $data['back'] = base_url()."?page=".MD5('hal 13');
                $data['next'] = base_url()."?page=".MD5('hal 15');
            } else if($page == MD5("hal 15")){
                $data['title'] = 'Halaman 15';
                $data['kata'] = [
                    [
                        "kata" => "تِـلْكَ اٰيٰـتُ الْـكِـتٰـبِ الْـحَـكِـيْـمِ",
                        "audio" => "15.1.m4a"
                    ],
                    [
                        "kata" => "فاَوْحٰى اِلٰى عَـبْـدِهٖ مَآاَوْحٰى",
                        "audio" => "15.2.m4a"
                    ],
                    [
                        "kata" => "وَلْـيُـؤْمِـنُـوْا بِيْ لَـعَـلَّـهُـمْ يَـرْشُـدُوْنَ",
                        "audio" => "15.3.m4a"
                    ],
                    [
                        "kata" => "فَـذَبَـحُـوْهَا وَمَا كَادُوْا يَـفْـعَـلُـوْنَ",
                        "audio" => "15.4.m4a"
                    ],
                    [
                        "kata" => "يَـعْـلَـمُ مَا يُـسِـرُّوْنَ وَمَا يُـعْـلِـنُـوْنَ",
                        "audio" => "15.5.m4a"
                    ],
                    [
                        "kata" => "فَـبِاَيِّ اٰلَآءِ رَبِّـكُـمَا تُـكَـذِّبَانِ",
                        "audio" => "15.6.m4a"
                    ],
                    [
                        "kata" => "وَالّـذِيْنَ هُـمْ لِـفُـرُوْجِـهِـمْ حٰـفِـظُـوْنَ",
                        "audio" => "15.7.m4a"
                    ],
                    [
                        "kata" => "اَلَّـذِيْنَ هُـمْ عَلٰى صَـلَاتِـهِـمْ دَآئِـمُـوْنَ",
                        "audio" => "15.8.m4a"
                    ]
                ];
                $data['back'] = base_url()."?page=".MD5('hal 14');
                $data['next'] = base_url()."?page=".MD5('hal 16');
            } else if($page == MD5("hal 16")){
                $data['title'] = 'Halaman 16';
                $data['kata'] = [
                    [
                        "kata" => "وَمَا لَـنَآ اَلَّا نُـقٰـتِـلَ فِيْ سَـبِـيْـلِ اللهِ",
                        "audio" => "16.1.m4a"
                    ],
                    [
                        "kata" => "اَللهُ لَآ اِلٰهَ اِلَّا هُوَ الْـحَـيُّ الْـقَـيُّـوْمُ",
                        "audio" => "16.2.m4a"
                    ],
                    [
                        "kata" => "فَـقَـرَّبَـهٗٓ اِلـيْـهِـمْ قَالَ اَلَا تَأْكُـلُـوْنَ",
                        "audio" => "16.3.m4a"
                    ],
                    [
                        "kata" => "بَـلْ جَآءَ بِالْـحَـقِّ وَ صَـدَّقَ الْـمُـرْسَـلِـيْنَ",
                        "audio" => "16.4.m4a"
                    ],
                    [
                        "kata" => "فَـيَـقُـوْلُ مَا هٰـذَآ اِلَّآ اَسٰـطِـيْـرُ الْاَوَّلِـيْـنَ",
                        "audio" => "16.5.m4a"
                    ],
                    [
                        "kata" => "اَللهَ رَبَّـكُـمْ وَرَبَّ اٰبَآئِـكُـمُ الْاَوَّلِـيْـنَ",
                        "audio" => "16.6.m4a"
                    ],
                    [
                        "kata" => "فَـرَاغَ اِلٰٓى اٰلِـهَـتِـهِـمْ فَـقَالَ اَلَا تَأْكُـلُـوْنَ",
                        "audio" => "16.7.m4a"
                    ],
                    [
                        "kata" => "اَفَـرَءَيْـتُـمُ الْمَآءَ الَّـذِيْ تَـشْـرَبُـوْنَ",
                        "audio" => "16.8.m4a"
                    ]
                    
                ];
                $data['back'] = base_url()."?page=".MD5('hal 15');
                // $data['next'] = base_url()."?page=".MD5('hal 16');
            }
            
            $this->load->view("templates/header-user", $data);
            $this->load->view("page/page", $data);
            $this->load->view("templates/footer-user", $data);
        } else {
            $data['title'] = "Pra Tahsin 3";
            $this->load->view("templates/header-user", $data);
            $this->load->view("page/index", $data);
            $this->load->view("templates/footer-user", $data);
        }
    }
}